src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КаталогПредметовСнабжения/Forms/ФормаПозицииТабличнойЧасти/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	ПредметСнабжения  = Параметры.ПредметСнабжения;
	
	Элементы.ГруппаХарактеристика.Видимость 			= (ИмяТабличнойЧасти = "Характеристики");
	Элементы.ГруппаАналоги.Видимость 					= (ИмяТабличнойЧасти = "Аналоги");
	Элементы.ГруппаИзготовителиИПоставщики.Видимость 	= (ИмяТабличнойЧасти = "ИзготовителиИПоставщики");

	Если ИмяТабличнойЧасти = "Характеристики" Тогда
		
		Если Параметры.Свойство("Характеристика", Характеристика) Тогда КонецЕсли;
		Если Параметры.Свойство("Значение", Значение) Тогда КонецЕсли;
		Если Параметры.Свойство("ЕдиницаИзмерения", ЕдиницаИзмерения) Тогда КонецЕсли;
		Если Параметры.Свойство("Основная", Основная) Тогда КонецЕсли;
		Если Параметры.Свойство("ОтображениеДляЗаказчика", ОтображениеДляЗаказчика) Тогда КонецЕсли;
		
		Если Параметры.Свойство("ВыбранныеХарактеристики") Тогда 
			ВыбранныеХарактеристики.ЗагрузитьЗначения(Параметры.ВыбранныеХарактеристики);	
		КонецЕсли;

		ЭтаФорма.Заголовок = "Характеристика";
	
	ИначеЕсли ИмяТабличнойЧасти = "Аналоги" Тогда
		
		Если Параметры.Свойство("Аналог", Аналог) Тогда КонецЕсли;
		Если Параметры.Свойство("ТипЗамены", ТипЗамены) Тогда КонецЕсли;
		
		ЭтаФорма.Заголовок = "Аналог";

	ИначеЕсли ИмяТабличнойЧасти = "ИзготовителиИПоставщики" Тогда
		
		Если Параметры.Свойство("Контрагент", Контрагент) Тогда КонецЕсли;
		Если Параметры.Свойство("Поставщик", Поставщик) Тогда КонецЕсли;
		Если Параметры.Свойство("Разработчик", Разработчик) Тогда КонецЕсли;
		Если Параметры.Свойство("Изготовитель", Изготовитель) Тогда КонецЕсли;
		Если Параметры.Свойство("СрокиИзготовления", СрокиИзготовления) Тогда КонецЕсли;
		Если Параметры.Свойство("ЕдиницаИзмерения", ЕдиницаИзмерения) Тогда КонецЕсли;
		Если Параметры.Свойство("СостояниеПроизводства", СостояниеПроизводства) Тогда КонецЕсли;
		
		Если Параметры.Свойство("ВыбранныеПоставщики") Тогда 
			ВыбранныеПоставщики.ЗагрузитьЗначения(Параметры.ВыбранныеПоставщики);	
		КонецЕсли;

		ЭтаФорма.Заголовок = "Поставщик";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	Ошибки = Неопределено;
	Если ИмяТабличнойЧасти = "Характеристики" Тогда
		
		Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Характеристика", НСтр("ru = 'Поле ""Характеристика"" не заполнено.'"), Неопределено);
					
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Значение", НСтр("ru = 'Поле ""Значение"" не заполнено.'"), Неопределено);
					
		КонецЕсли; 
		
		ПараметрыЗакрытия.Вставить("Характеристика", Характеристика);
		ПараметрыЗакрытия.Вставить("Значение", Значение);
		ПараметрыЗакрытия.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
		ПараметрыЗакрытия.Вставить("Основная", Основная);
		ПараметрыЗакрытия.Вставить("ОтображениеДляЗаказчика", ОтображениеДляЗаказчика);
		
	ИначеЕсли ИмяТабличнойЧасти = "Аналоги" Тогда
		
		Если НЕ ЗначениеЗаполнено(Аналог) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Аналог", НСтр("ru = 'Поле ""Аналог"" не заполнено.'"), Неопределено);
			
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ТипЗамены) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ТипЗамены", НСтр("ru = 'Поле ""ТипЗамены"" не заполнено.'"), Неопределено);
			
		КонецЕсли; 
		
		ПараметрыЗакрытия.Вставить("Аналог", Аналог);
		ПараметрыЗакрытия.Вставить("ТипЗамены", ТипЗамены);
		
	ИначеЕсли ИмяТабличнойЧасти = "ИзготовителиИПоставщики" Тогда
		
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Контрагент", НСтр("ru = 'Поле ""Контрагент"" не заполнено.'"), Неопределено);
					
		КонецЕсли;
		
		ПараметрыЗакрытия.Вставить("Контрагент", Контрагент);
		ПараметрыЗакрытия.Вставить("Поставщик", Поставщик);
		ПараметрыЗакрытия.Вставить("Разработчик", Разработчик);
		ПараметрыЗакрытия.Вставить("Изготовитель", Изготовитель);
		ПараметрыЗакрытия.Вставить("СрокиИзготовления", СрокиИзготовления);
		ПараметрыЗакрытия.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
		ПараметрыЗакрытия.Вставить("СостояниеПроизводства", СостояниеПроизводства);

	КонецЕсли;  	
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
	Иначе
		
		Закрыть(ПараметрыЗакрытия);

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтбора = Новый НастройкиКомпоновкиДанных;
	
	Если ВыбранныеХарактеристики.Количество() > 0 Тогда
		НовыйЭлемент = НастройкиОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		НовыйЭлемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеВСписке;
		НовыйЭлемент.ПравоеЗначение= ВыбранныеХарактеристики;
	КонецЕсли;		
	
	ОткрытьФорму("Справочник.ХарактеристикиПредметовСнабжения.ФормаВыбора", Новый Структура("ФиксированныеНастройки", НастройкиОтбора), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АналогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтбора = Новый НастройкиКомпоновкиДанных;
	
	НовыйЭлемент = НастройкиОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	НовыйЭлемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеРавно;
	НовыйЭлемент.ПравоеЗначение= ПредметСнабжения;
		
	ОткрытьФорму("Справочник.КаталогПредметовСнабжения.Форма.ФормаВыбора", Новый Структура("ФиксированныеНастройки", НастройкиОтбора), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтбора = Новый НастройкиКомпоновкиДанных;
	
	Если ВыбранныеПоставщики.Количество() > 0 Тогда
		НовыйЭлемент = НастройкиОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		НовыйЭлемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеВСписке;
		НовыйЭлемент.ПравоеЗначение= ВыбранныеПоставщики;
	КонецЕсли;		
	
	ОткрытьФорму("Справочник.Организации.Форма.ФормаВыбора", Новый Структура("ФиксированныеНастройки", НастройкиОтбора), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмерения1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыборДляПредметовСнабжения");
	
	ОткрытьФорму("Справочник.ОКЕИ.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект); 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Организации.Форма.ФормаВыбора" Тогда
		
		Контрагент = ВыбранноеЗначение;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.КаталогПредметовСнабжения.Форма.ФормаВыбора" Тогда
		
		Аналог = ВыбранноеЗначение;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ХарактеристикиПредметовСнабжения.ФормаВыбора" Тогда
		
		Характеристика = ВыбранноеЗначение;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ОКЕИ.Форма.ФормаВыбора" Тогда
		
		ЕдиницаИзмерения = ВыбранноеЗначение;

	КонецЕсли;  
	
КонецПроцедуры
